app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)
    if @list.save
---
INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES ('test1', 'test1', '2026-04-07 09:16:40.073938', '2026-04-07 09:16:40.073938') RETURNING "id"

  def update
    list = List.find(params[:id])
    list.update(list_params)
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = NULL LIMIT 1
UPDATE "lists" SET "body" = '七星剣舞祭学校予選決勝、学内最強雷切との最終決戦', "updated_at" = '2026-04-08 11:17:09.751035' WHERE "lists"."id" = 5

  def destroy
    list = List.find(params[:id])
    list.destroy
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = NULL LIMIT 1
DELETE FROM "lists" WHERE "lists"."id" = 1